{"What are the prerequisites for this course?": "what are the prerequisit for thi cours ? what are the prereq for coursecod ? what are the prereq for thi cours ? are there strict prereq for coursecod ? can I take thi cours right now ? Am I abl to take coursecodeat the moment ? what do I still need to complet befor I can take coursecod ? how mani more class do I need befor I can take coursecod ? '' what els do I need to take befor I can take thi class are there ani more prerequisit I need to take what els do I need to take befor I can take thi class ?  what are the prereq for my class ", "Who are the instructors for this course?": "who teach thi cours ? what instructor teach coursecod ? can you tell me the instructor teach thi cours ? instructor teacher professor teach learn instruct who who who teacher what teacher who teach  prereq  yo yo yo what are prereq ", "What are the equivalent courses for this course?": "equival equival equival cours cours cours cours coursecod coursecod what what are some similar similar similar equal altern altern other other class cours section what are the equival cours for coursecod ? ? ? ? ", "Are these courses equivalent?": "are these cours equival equival equal doe thi count for coursecod ? count cross list cross list cross list are these exchang can i exchang these cours two two two ", "What are the notes for this course?": "what are the note for thi cours what els can you tell me about coursecod ? what do you know about thi cours know fact els anyth els more inform more additon ", "Which quarters is this course offered?": "which quarter is coursecodeoff ? offer offer which which which when when when when quarter quarter quarter semest semest semest term term term offer taught avail open  quit  prereq ", "What majors do you support?": "what major do you support major major major avail support avail what how mani how mani what major can I take I take what do you know how to do ", "What requirements do I have left for my major?": "what requir do I have left for my major have left have left what requir do I have left to do what do I still need to do what still remain for me to do remain major requir what requir do I have left for my major ? what remain to be done for my major what requir do I have remain what do I still have to do for my major what is there left for me to do still ", "Do I meet the prerequisites for this course?": "do I meet the prerequis for ccoursecod ? Am I abl to take thi class ? do I meet the requir for thi cours ? will I be abl to take coursecod ? coursecod ? Am I qualifi to take thi cours ? am I abl to take thi cours coursecod ", "Can you add this course to my schedule?": "can you add thi cours to my schedul add thi to my schedul add coursecod to my schedul add add can you put coursecod onto my schedul can you fill in coursecod in winter quarter for me quarter quarter quarter semest semest semest year year year year ", "Can you remove this course from my schedule?": "can you remov coursecod from my schedul remov remov remov remov can you take coursecod off my schedul schedul schedul pleas remov thi class from my schedul class class ", "Can you show me my schedule?": "can you show me my schedul what doe my schedul look like so far can I see my schedul show me my class ", "Submit a comment to my developers.": "submit a question to my develop suggest for the dev can you tell the dev someth pass along thi inform to the develop can I suggest a chang chang suggest question advic improv you should includ ", "Can you change my major?": "can you chang my major could you updat my major pleas major can I get a new major new major chang major get a new major chang ", "What do people think about a certain aspect of this course?": "what do peopl think about a certain aspect of thi cours what student felt about cours aspect student feel cours student thought on cours student thought on cours aspect wht did student thik about aspect of thisc class what did student feel about aspect of thi cours coursecod coursecod coursecod ", "What did people think about this course?": "student thought on cours student think about cours cours eval sentiment analysi what did student think about thi cours what did peopl think about thi class "}
